### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/fb300600-9bda-4bcf-8def-0b27b99a19f6/terraform-bin show -no-color plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                            = "about.html"
      ~ source_hash                   = "375ce905b0d4b5c4a176be225ba86ef6" -> "eb0354b4742cd80095dfe4a1bf1c4331"
        tags                          = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id                    = (known after apply)
        # (20 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                            = "articles.html"
      ~ source_hash                   = "ebd156669995bce9475604acdf28b8ff" -> "bc0bba757e4f0db30635d8b85cbb5e8a"
        tags                          = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id                    = (known after apply)
        # (20 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                            = "articles/learning-to-unit-test-en.html"
      ~ source_hash                   = "a77053dd8a6b2fa5e3745ebf2031d424" -> "c08647e3f23fabe023aabaa7c4e1571e"
        tags                          = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id                    = (known after apply)
        # (20 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                            = "articles/learning-to-unit-test-es.html"
      ~ source_hash                   = "f1e446f1c0a2366d12b4d63a3584af08" -> "bc2d5973cb32b5f046ec8d487abc47d4"
        tags                          = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id                    = (known after apply)
        # (20 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-d8027794.js"] will be destroyed
  # (because key ["assets/About-d8027794.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "16287c9f3b6f5e4bcc96ab7ae591f7d8" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/About-d8027794.js" -> null
      - key                           = "assets/About-d8027794.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/About-d8027794.js" -> null
      - source_hash                   = "16287c9f3b6f5e4bcc96ab7ae591f7d8" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-ecc5c7e3.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-ecc5c7e3.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-ecc5c7e3.js"
      + source_hash            = "a4e010455dc421dbeafb075c568b859d"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-169ae7fe.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-169ae7fe.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-169ae7fe.js"
      + source_hash            = "d93f562cdd35e6f8dfe83a9aea40561a"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-b3fb4ce8.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-b3fb4ce8.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "402df342b27b39d091c359a812eba8bc" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/ArticleLayouts-b3fb4ce8.js" -> null
      - key                           = "assets/ArticleLayouts-b3fb4ce8.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/ArticleLayouts-b3fb4ce8.js" -> null
      - source_hash                   = "402df342b27b39d091c359a812eba8bc" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-04e3fd7c.js"] will be destroyed
  # (because key ["assets/Articles-04e3fd7c.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "826800e362dc9f017df3fc75b1862ca9" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/Articles-04e3fd7c.js" -> null
      - key                           = "assets/Articles-04e3fd7c.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/Articles-04e3fd7c.js" -> null
      - source_hash                   = "826800e362dc9f017df3fc75b1862ca9" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-0d8ebaa8.css"] will be destroyed
  # (because key ["assets/Articles-0d8ebaa8.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "text/css" -> null
      - etag                          = "33c3c94cc1859add12238311d16f6c1f" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/Articles-0d8ebaa8.css" -> null
      - key                           = "assets/Articles-0d8ebaa8.css" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/Articles-0d8ebaa8.css" -> null
      - source_hash                   = "33c3c94cc1859add12238311d16f6c1f" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-156bce91.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-156bce91.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-156bce91.css"
      + source_hash            = "eed003e069212b87137259c5da7d88b9"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-a18adc52.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-a18adc52.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-a18adc52.js"
      + source_hash            = "f00b04648eeb0bf1f577936d739c876a"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-93b026bd.js"] will be destroyed
  # (because key ["assets/Landing-93b026bd.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "da15f7d5e27598f212ee64884308bfbc" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/Landing-93b026bd.js" -> null
      - key                           = "assets/Landing-93b026bd.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/Landing-93b026bd.js" -> null
      - source_hash                   = "da15f7d5e27598f212ee64884308bfbc" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-997ad1de.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-997ad1de.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-997ad1de.css"
      + source_hash            = "88111e0a9181acecff890b514a993127"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-a96b032e.css"] will be destroyed
  # (because key ["assets/Landing-a96b032e.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "text/css" -> null
      - etag                          = "8c544421623ccc444b2ebb24e21604c6" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/Landing-a96b032e.css" -> null
      - key                           = "assets/Landing-a96b032e.css" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/Landing-a96b032e.css" -> null
      - source_hash                   = "8c544421623ccc444b2ebb24e21604c6" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-b350204f.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-b350204f.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-b350204f.js"
      + source_hash            = "a043469eece1c38c0980dd012c1c6831"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-034a9571.js"] will be destroyed
  # (because key ["assets/PDF-034a9571.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "5696112e97b4eeae2baabc9de39a6070" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/PDF-034a9571.js" -> null
      - key                           = "assets/PDF-034a9571.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/PDF-034a9571.js" -> null
      - source_hash                   = "5696112e97b4eeae2baabc9de39a6070" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-bf06484a.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-bf06484a.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-bf06484a.js"
      + source_hash            = "ccde0a590065fd426eac532a58048952"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-c2a05d59.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-c2a05d59.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-c2a05d59.css"
      + source_hash            = "a9a4939e56e383597c29b00d6c139b93"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-cd6aeca2.css"] will be destroyed
  # (because key ["assets/PDF-cd6aeca2.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "text/css" -> null
      - etag                          = "460980a08fb6a7fb9af48988c5e5cc28" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/PDF-cd6aeca2.css" -> null
      - key                           = "assets/PDF-cd6aeca2.css" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/PDF-cd6aeca2.css" -> null
      - source_hash                   = "460980a08fb6a7fb9af48988c5e5cc28" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-1c4e9c73.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-1c4e9c73.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-1c4e9c73.js"
      + source_hash            = "7bb074229467ea95f0360c9407accf3f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-4a3a2423.js"] will be destroyed
  # (because key ["assets/Start-4a3a2423.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "cef2fa40161b990376f031e3fbc10284" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/Start-4a3a2423.js" -> null
      - key                           = "assets/Start-4a3a2423.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/Start-4a3a2423.js" -> null
      - source_hash                   = "cef2fa40161b990376f031e3fbc10284" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-4b791a9c.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartNav-4b791a9c.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartNav-4b791a9c.js"
      + source_hash            = "e0d1fac5599c56e90e60ff183f8cc2da"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-d797807d.js"] will be destroyed
  # (because key ["assets/StartNav-d797807d.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "d2475575e11aad4a25a03038d3660bb3" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/StartNav-d797807d.js" -> null
      - key                           = "assets/StartNav-d797807d.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/StartNav-d797807d.js" -> null
      - source_hash                   = "d2475575e11aad4a25a03038d3660bb3" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-631dccf9.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/app-631dccf9.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/app-631dccf9.js"
      + source_hash            = "826b8c45b881ffdfbcf17406538be063"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-cbe52a62.js"] will be destroyed
  # (because key ["assets/app-cbe52a62.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "2d45126d3abd19480cb0dca9a02779b1" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/app-cbe52a62.js" -> null
      - key                           = "assets/app-cbe52a62.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/app-cbe52a62.js" -> null
      - source_hash                   = "2d45126d3abd19480cb0dca9a02779b1" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap-2f49b383.css"] will be destroyed
  # (because key ["assets/bootstrap-2f49b383.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "text/css" -> null
      - etag                          = "452e3c0684a0657a691145f0fb7e4da8" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/bootstrap-2f49b383.css" -> null
      - key                           = "assets/bootstrap-2f49b383.css" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/bootstrap-2f49b383.css" -> null
      - source_hash                   = "452e3c0684a0657a691145f0fb7e4da8" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap-d3042869.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/bootstrap-d3042869.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/bootstrap-d3042869.css"
      + source_hash            = "aa0dd77b56885af0eff5dc42f8afdd7e"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap.esm-5ea4a862.js"] will be destroyed
  # (because key ["assets/bootstrap.esm-5ea4a862.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "39b7d6a0e8ea05a02d17e1cda0bae126" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/bootstrap.esm-5ea4a862.js" -> null
      - key                           = "assets/bootstrap.esm-5ea4a862.js" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/bootstrap.esm-5ea4a862.js" -> null
      - source_hash                   = "39b7d6a0e8ea05a02d17e1cda0bae126" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap.esm-b3022f36.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/bootstrap.esm-b3022f36.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/bootstrap.esm-b3022f36.js"
      + source_hash            = "84c54d05b6bd687ca1bddf81dc0f11e5"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-e3f0835f.js"] will be destroyed
  # (because key ["assets/index.es-e3f0835f.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "fface31a131e5d48b1b10f6d4ebc5a6b" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/index.es-e3f0835f.js" -> null
      - key                           = "assets/index.es-e3f0835f.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/index.es-e3f0835f.js" -> null
      - source_hash                   = "fface31a131e5d48b1b10f6d4ebc5a6b" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-f978370b.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-f978370b.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-f978370b.js"
      + source_hash            = "d354122d7a05ee66fb978871a2cbcd5e"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-384a0363.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/jquery.easing-384a0363.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/jquery.easing-384a0363.js"
      + source_hash            = "a03a2a399764db470d0c1d32612fa817"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-ae02a0cd.js"] will be destroyed
  # (because key ["assets/jquery.easing-ae02a0cd.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "a4abbd8c35f7077a2a612ef1c399f598" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/jquery.easing-ae02a0cd.js" -> null
      - key                           = "assets/jquery.easing-ae02a0cd.js" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/jquery.easing-ae02a0cd.js" -> null
      - source_hash                   = "a4abbd8c35f7077a2a612ef1c399f598" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-2de9db7f.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/purify.es-2de9db7f.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/purify.es-2de9db7f.js"
      + source_hash            = "9ee91666d5b383de6432f9cfef71e440"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-f47f2ec0.js"] will be destroyed
  # (because key ["assets/purify.es-f47f2ec0.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                           = "private" -> null
      - bucket                        = "uat.shortpoet.com" -> null
      - bucket_key_enabled            = false -> null
      - cache_control                 = "max-age=31536000, immutable" -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "78cfbb6e8ee5339d33996b52efa1a754" -> null
      - force_destroy                 = true -> null
      - id                            = "assets/purify.es-f47f2ec0.js" -> null
      - key                           = "assets/purify.es-f47f2ec0.js" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "./../../../../../app/build/assets/purify.es-f47f2ec0.js" -> null
      - source_hash                   = "78cfbb6e8ee5339d33996b52efa1a754" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all                      = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
        # (8 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                            = "index.html"
      ~ source_hash                   = "b8d5a60bdf514ebffe2ee95eacea7abd" -> "86c66b95c48bae1717549f50bff8e6b8"
        tags                          = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id                    = (known after apply)
        # (20 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["pdf.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                            = "pdf.html"
      ~ source_hash                   = "82a5d293ad48609ca52ea0ce44b59f89" -> "d59991a896929deed4f1e3d4bd925c04"
        tags                          = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id                    = (known after apply)
        # (20 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["resume.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                            = "resume.html"
      ~ source_hash                   = "293b3c0e282517846d8754f75fbc81df" -> "e8901ce7cdf45f32e0e7c681f765e6b9"
        tags                          = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id                    = (known after apply)
        # (20 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                            = "sitemap.xml"
      ~ source_hash                   = "3177c092f7b3c88882c69a61119df5ae" -> "40458ddab5cef087c9b87ad0086c1077"
        tags                          = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id                    = (known after apply)
        # (20 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["ssr-manifest.json"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                            = "ssr-manifest.json"
      ~ source_hash                   = "97ecc459e821b9217e1df0fda5a9e303" -> "72c4315473b5e284bb8c0b3a6a5581bd"
        tags                          = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id                    = (known after apply)
        # (20 unchanged attributes hidden)
    }

Plan: 16 to add, 9 to change, 16 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
        # (4 unchanged elements hidden)
        "f1e446f1c0a2366d12b4d63a3584af08",
      ~ "16287c9f3b6f5e4bcc96ab7ae591f7d8" -> (known after apply),
      ~ "402df342b27b39d091c359a812eba8bc" -> (known after apply),
      ~ "826800e362dc9f017df3fc75b1862ca9" -> (known after apply),
      ~ "33c3c94cc1859add12238311d16f6c1f" -> (known after apply),
      ~ "da15f7d5e27598f212ee64884308bfbc" -> (known after apply),
      ~ "8c544421623ccc444b2ebb24e21604c6" -> (known after apply),
      ~ "5696112e97b4eeae2baabc9de39a6070" -> (known after apply),
      ~ "460980a08fb6a7fb9af48988c5e5cc28" -> (known after apply),
      ~ "cef2fa40161b990376f031e3fbc10284" -> (known after apply),
      ~ "35bc2af385e37e6def98966cb8b61301" -> (known after apply),
      ~ "d2475575e11aad4a25a03038d3660bb3" -> "35bc2af385e37e6def98966cb8b61301",
      ~ "2d45126d3abd19480cb0dca9a02779b1" -> (known after apply),
        "e60911495dba8bb96def57539a94e9cf",
        "302f026f7e053d0ccf4b0ed827f15900",
      ~ "452e3c0684a0657a691145f0fb7e4da8" -> (known after apply),
      ~ "39b7d6a0e8ea05a02d17e1cda0bae126" -> (known after apply),
        "89db6545390762231d3913a3cd717cf3",
        # (12 unchanged elements hidden)
        "f3b3742a10ca3e3bc76add45dcc7d52b",
      ~ "fface31a131e5d48b1b10f6d4ebc5a6b" -> (known after apply),
      ~ "a4abbd8c35f7077a2a612ef1c399f598" -> (known after apply),
        "3af47f89e61fe763b909c1fabc4c4083",
      ~ "78cfbb6e8ee5339d33996b52efa1a754" -> (known after apply),
        "b42fa60cb28ab38ad51179e8b40ff867",
        # (16 unchanged elements hidden)
    ]
  ~ s3_bucket_object_ids         = [
        # (4 unchanged elements hidden)
        "articles/learning-to-unit-test-es.html",
      ~ "assets/About-d8027794.js" -> (known after apply),
      ~ "assets/ArticleLayouts-b3fb4ce8.js" -> (known after apply),
      ~ "assets/Articles-04e3fd7c.js" -> (known after apply),
      ~ "assets/Articles-0d8ebaa8.css" -> (known after apply),
      ~ "assets/Landing-93b026bd.js" -> (known after apply),
      ~ "assets/Landing-a96b032e.css" -> (known after apply),
      ~ "assets/PDF-034a9571.js" -> (known after apply),
      ~ "assets/PDF-cd6aeca2.css" -> (known after apply),
      ~ "assets/Start-4a3a2423.js" -> (known after apply),
      ~ "assets/StartNav-cb1e6734.css" -> (known after apply),
      ~ "assets/StartNav-d797807d.js" -> "assets/StartNav-cb1e6734.css",
      ~ "assets/app-cbe52a62.js" -> (known after apply),
        "assets/azure_devicon_forest_green-ee780a3a.svg",
        "assets/bash_devicon_forest_green-ab536553.svg",
      ~ "assets/bootstrap-2f49b383.css" -> (known after apply),
      ~ "assets/bootstrap.esm-5ea4a862.js" -> (known after apply),
        "assets/d3_devicon_forest_green-b8696bec.svg",
        # (12 unchanged elements hidden)
        "assets/index-1cb490d5.css",
      ~ "assets/index.es-e3f0835f.js" -> (known after apply),
      ~ "assets/jquery.easing-ae02a0cd.js" -> (known after apply),
        "assets/powershell_devicon_forest_green-f06a1fda.svg",
      ~ "assets/purify.es-f47f2ec0.js" -> (known after apply),
        "assets/tableau_logo-ec7acb2d.svg",
        # (16 unchanged elements hidden)
    ]
  ~ s3_bucket_object_keys_ids    = [
        # (4 unchanged elements hidden)
        {
            id  = "articles/learning-to-unit-test-es.html"
            key = "articles/learning-to-unit-test-es.html"
        },
      ~ {
          ~ id  = "assets/About-d8027794.js" -> (known after apply)
          ~ key = "assets/About-d8027794.js" -> "assets/About-ecc5c7e3.js"
        },
      ~ {
          ~ id  = "assets/ArticleLayouts-b3fb4ce8.js" -> (known after apply)
          ~ key = "assets/ArticleLayouts-b3fb4ce8.js" -> "assets/ArticleLayouts-169ae7fe.js"
        },
      ~ {
          ~ id  = "assets/Articles-04e3fd7c.js" -> (known after apply)
          ~ key = "assets/Articles-04e3fd7c.js" -> "assets/Articles-156bce91.css"
        },
      ~ {
          ~ id  = "assets/Articles-0d8ebaa8.css" -> (known after apply)
          ~ key = "assets/Articles-0d8ebaa8.css" -> "assets/Articles-a18adc52.js"
        },
      ~ {
          ~ id  = "assets/Landing-93b026bd.js" -> (known after apply)
          ~ key = "assets/Landing-93b026bd.js" -> "assets/Landing-997ad1de.css"
        },
      ~ {
          ~ id  = "assets/Landing-a96b032e.css" -> (known after apply)
          ~ key = "assets/Landing-a96b032e.css" -> "assets/Landing-b350204f.js"
        },
      ~ {
          ~ id  = "assets/PDF-034a9571.js" -> (known after apply)
          ~ key = "assets/PDF-034a9571.js" -> "assets/PDF-bf06484a.js"
        },
      ~ {
          ~ id  = "assets/PDF-cd6aeca2.css" -> (known after apply)
          ~ key = "assets/PDF-cd6aeca2.css" -> "assets/PDF-c2a05d59.css"
        },
      ~ {
          ~ id  = "assets/Start-4a3a2423.js" -> (known after apply)
          ~ key = "assets/Start-4a3a2423.js" -> "assets/Start-1c4e9c73.js"
        },
      ~ {
          ~ id  = "assets/StartNav-cb1e6734.css" -> (known after apply)
          ~ key = "assets/StartNav-cb1e6734.css" -> "assets/StartNav-4b791a9c.js"
        },
      ~ {
          ~ id  = "assets/StartNav-d797807d.js" -> "assets/StartNav-cb1e6734.css"
          ~ key = "assets/StartNav-d797807d.js" -> "assets/StartNav-cb1e6734.css"
        },
      ~ {
          ~ id  = "assets/app-cbe52a62.js" -> (known after apply)
          ~ key = "assets/app-cbe52a62.js" -> "assets/app-631dccf9.js"
        },
        {
            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"
            key = "assets/azure_devicon_forest_green-ee780a3a.svg"
        },
        {
            id  = "assets/bash_devicon_forest_green-ab536553.svg"
            key = "assets/bash_devicon_forest_green-ab536553.svg"
        },
      ~ {
          ~ id  = "assets/bootstrap-2f49b383.css" -> (known after apply)
          ~ key = "assets/bootstrap-2f49b383.css" -> "assets/bootstrap-d3042869.css"
        },
      ~ {
          ~ id  = "assets/bootstrap.esm-5ea4a862.js" -> (known after apply)
          ~ key = "assets/bootstrap.esm-5ea4a862.js" -> "assets/bootstrap.esm-b3022f36.js"
        },
        {
            id  = "assets/d3_devicon_forest_green-b8696bec.svg"
            key = "assets/d3_devicon_forest_green-b8696bec.svg"
        },
        # (12 unchanged elements hidden)
        {
            id  = "assets/index-1cb490d5.css"
            key = "assets/index-1cb490d5.css"
        },
      ~ {
          ~ id  = "assets/index.es-e3f0835f.js" -> (known after apply)
          ~ key = "assets/index.es-e3f0835f.js" -> "assets/index.es-f978370b.js"
        },
      ~ {
          ~ id  = "assets/jque
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*